In [6]:
import pandas as pd # import pandas library
dfaa = pd.read_table('dataset/listings/listingsaa.tsv', low_memory=False) # read the tsv files into a pandas dataframe object

dfaa

         Record Number                                              Title
0                    1  Supreme Nike SB Dunk High By any Means Red US1...
1                    2  New Balance 530 Männer und Frauen Laufschuhe m...
2                    3                     ♥ MICHAEL KORS Sneaker Gr 39 ♥
3                    4             New Balance ML 574 EGO Turnschuhe grün
4                    5  Nike air jordan 9 og , space jam , hare , bugs...
...                ...                                                ...
1183215        1184443  Nike AIR JORDAN 1 RETRO HIGH OG - US 11 EUR 45...
1183216        1184444                FUBU Web Block Low Leder white grey
1183217        1184445   [ NEU ] Adidas ZX 750 BLAU / WEISS versch.Größen
1183218        1184446  Puma Unisex Enzo Terrain Laufschuhe ( grau ) -...
1183219        1184447  Asics Aaron off white / red H900N9923 Größe EU...

[1183220 rows x 2 columns]

In [7]:
# import all tsv files similarly
dfab = pd.read_table('dataset/listings/listingsab.tsv', low_memory=False)
dfac = pd.read_table('dataset/listings/listingsac.tsv', low_memory=False)
dfad = pd.read_table('dataset/listings/listingsad.tsv', low_memory=False)
dfae = pd.read_table('dataset/listings/listingsae.tsv', low_memory=False
dfaf = pd.read_table('dataset/listings/listingsaf.tsv', low_memory=False)
dfag = pd.read_table('dataset/listings/listingsag.tsv', low_memory=False)
dfah = pd.read_table('dataset/listings/listingsah.tsv', low_memory=False)
dfai = pd.read_table('dataset/listings/listingsai.tsv', low_memory=False)

In [13]:
everything = [dfaa, dfab, dfac, dfad, dfae, dfaf, dfag, dfah, dfai]

for frame in everything:
    print(frame.shape)

(1183220, 2)
(1168556, 2)
(1168795, 2)
(1168621, 2)
(1167540, 2)
(1167982, 2)
(1168639, 2)
(1168832, 2)
(629497, 2)

In [11]:
# append dataframes

df = pd.concat([dfaa, dfab, dfac, dfad, dfae, dfaf, dfag, dfah, dfai], ignore_index=True)

df

         Record Number                                              Title
0                    1  Supreme Nike SB Dunk High By any Means Red US1...
1                    2  New Balance 530 Männer und Frauen Laufschuhe m...
2                    3                     ♥ MICHAEL KORS Sneaker Gr 39 ♥
3                    4             New Balance ML 574 EGO Turnschuhe grün
4                    5  Nike air jordan 9 og , space jam , hare , bugs...
...                ...                                                ...
9991677        9999996  Skechers Compulsions Z Strap Damen Schwarz Tur...
9991678        9999997                     Neu bogner 199 . Euro neupreis
9991679        9999998  New Balance M670 Herren US 11 Schwarz Tennissc...
9991680        9999999  Pepe Jeans Tinker Pro 73 Edt 20 Sneakers Herre...
9991681       10000000  HERREN SCHUHE SNEAKERS ADIDAS ORIGINALS X_PLR ...

[9991682 rows x 2 columns]

In [12]:
df.shape

(9991682, 2)